# Missing value

In [1]:
import pandas as pd
import numpy as np

In [2]:
d=pd.date_range('20020301',periods=10)

In [3]:
df=pd.DataFrame(np.random.randn(10,4),index=d,columns=['A','B','C','D'])

In [4]:
df2=df.reindex(index=d[0:4],columns=list(df.columns)+['E'])

In [5]:
print(df2)

                   A         B         C         D   E
2002-03-01 -1.990349 -0.797118  1.042431 -1.017091 NaN
2002-03-02  2.676822  1.067154 -0.641501 -0.117837 NaN
2002-03-03 -0.867453  0.473514  0.708834 -0.532861 NaN
2002-03-04 -2.074578 -0.853820  1.740326 -0.639178 NaN

In [6]:
df2.loc[d[0]:d[1],'E']=1

In [7]:
df2

                   A         B         C         D    E
2002-03-01 -1.990349 -0.797118  1.042431 -1.017091  1.0
2002-03-02  2.676822  1.067154 -0.641501 -0.117837  1.0
2002-03-03 -0.867453  0.473514  0.708834 -0.532861  NaN
2002-03-04 -2.074578 -0.853820  1.740326 -0.639178  NaN

In [8]:
df2.isnull()

                A      B      C      D      E
2002-03-01  False  False  False  False  False
2002-03-02  False  False  False  False  False
2002-03-03  False  False  False  False   True
2002-03-04  False  False  False  False   True

In [9]:
df2.isnull().count()

A    4
B    4
C    4
D    4
E    4
dtype: int64

In [10]:
df2.dropna()
# drop the row which has null value

                   A         B         C         D    E
2002-03-01 -1.990349 -0.797118  1.042431 -1.017091  1.0
2002-03-02  2.676822  1.067154 -0.641501 -0.117837  1.0

In [11]:
df2.fillna(value=2)
# here we will replace the blank value to value =2

                   A         B         C         D    E
2002-03-01 -1.990349 -0.797118  1.042431 -1.017091  1.0
2002-03-02  2.676822  1.067154 -0.641501 -0.117837  1.0
2002-03-03 -0.867453  0.473514  0.708834 -0.532861  2.0
2002-03-04 -2.074578 -0.853820  1.740326 -0.639178  2.0

In [12]:
pd.isna(df2)
# here we will know that  True for the value is missing and false for 
# value is already exit

                A      B      C      D      E
2002-03-01  False  False  False  False  False
2002-03-02  False  False  False  False  False
2002-03-03  False  False  False  False   True
2002-03-04  False  False  False  False   True